№2
нод
a, b = map(int,input().split()
while a != 0 and b != 0: #пока х и у не равно 0

    if a > b:
        a = a % b #присваиваем а значение остатка
    else:
        b = b % a #присваем значению б значения остатка от деления на а, если а<б
 
print(a+b) #одна из переменных ноль, но мы не знаем какая, поэтому мы находим их сумму

нок
a,b =map(int,input().split())
m=max(b,a) #ищем максимум среди двух чисел
while True:
    if m%b==0 and m%a==0: #пока утверждение "остаток от деления на чила, которые ввел пользователь равен нулю" является верным
        print(m)
        break #дает программе выйти из цикла
    else:
        m=m+1  #увеличиваем число на 1 и продолжаем цикл
